Tekla Open API Reference for Tekla Structures 2025
LayoutAttributes.SheetSize Property
 Gets or sets the sheet size. Setting this property will change the SizeDefinitionMode to SpecifiedSize.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Size SheetSize { get; set; }
Public Property SheetSize As Size
	Get
	Set
Property Value
Type: Size
See Also
Reference
LayoutAttributes Class
Tekla.Structures.Drawing Namespace